; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	infrared3 - mode
	thermograph2 - mode
	infrared0 - mode
	thermograph1 - mode
	GroundStation1 - direction
	Star4 - direction
	GroundStation0 - direction
	Star2 - direction
	GroundStation3 - direction
	Planet5 - direction
	Star6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 thermograph2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument1 infrared3)
	(calibration_target instrument1 Star2)
	(supports instrument2 infrared3)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared0)
	(calibration_target instrument2 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument3 thermograph2)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared3)
	(calibration_target instrument3 Star2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 GroundStation0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 GroundStation3)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet5)
	(supports instrument6 thermograph2)
	(supports instrument6 infrared3)
	(calibration_target instrument6 GroundStation3)
	(supports instrument7 thermograph2)
	(supports instrument7 thermograph1)
	(calibration_target instrument7 GroundStation0)
	(supports instrument8 infrared3)
	(calibration_target instrument8 GroundStation0)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star7)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star2)
	(supports instrument10 thermograph2)
	(calibration_target instrument10 GroundStation3)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star4)
)
(:goal (and
	(pointing satellite0 Star9)
	(pointing satellite1 Planet5)
	(pointing satellite2 Planet5)
	(pointing satellite4 GroundStation1)
	(have_image Planet5 infrared3)
	(have_image Star6 thermograph1)
	(have_image Star7 infrared0)
	(have_image Planet8 thermograph1)
	(have_image Star9 thermograph2)
	(have_image Planet10 thermograph1)
	(have_image Star11 infrared3)
))

)

; plan
1. (turn_to satellite4 groundstation1 star4)
   deleted: (pointing satellite4 star4)
   added: (pointing satellite4 groundstation1)
   goals met: 2 of 11
2. (turn_to satellite2 star2 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 star2)
   goals met: 1 of 11
3. (switch_on instrument3 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument3)
   goals met: 1 of 11
4. (calibrate satellite2 instrument3 star2)
   added: (calibrated instrument3)
   goals met: 1 of 11
5. (turn_to satellite2 planet8 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 planet8)
   goals met: 1 of 11
6. (take_image satellite2 planet8 instrument3 thermograph1)
   added: (have_image planet8 thermograph1)
   goals met: 2 of 11
7. (turn_to satellite2 planet10 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet10)
   goals met: 2 of 11
8. (turn_to satellite1 planet5 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 planet5)
   goals met: 3 of 11
9. (turn_to satellite0 star4 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star4)
   goals met: 3 of 11
10. (take_image satellite2 planet10 instrument3 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 4 of 11
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 11
12. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 4 of 11
13. (turn_to satellite0 star11 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star11)
   goals met: 4 of 11
14. (take_image satellite0 star11 instrument0 infrared3)
   added: (have_image star11 infrared3)
   goals met: 5 of 11
15. (turn_to satellite0 star7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star7)
   goals met: 5 of 11
16. (take_image satellite0 star7 instrument0 infrared0)
   added: (have_image star7 infrared0)
   goals met: 6 of 11
17. (turn_to satellite0 star9 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star9)
   goals met: 7 of 11
18. (take_image satellite0 star9 instrument0 thermograph2)
   added: (have_image star9 thermograph2)
   goals met: 8 of 11
19. (turn_to satellite2 star6 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 star6)
   goals met: 8 of 11
20. (take_image satellite2 star6 instrument3 thermograph1)
   added: (have_image star6 thermograph1)
   goals met: 9 of 11
21. (turn_to satellite2 planet5 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 planet5)
   goals met: 10 of 11
22. (take_image satellite2 planet5 instrument3 infrared3)
   added: (have_image planet5 infrared3)
   goals met: 11 of 11
